In [26]:
import numpy as np
import pandas as pd
from itertools import product
from sklearn.preprocessing import LabelEncoder

import seaborn as sns
import matplotlib.pyplot as plt

def plot_features(booster, figsize):
    fig, ax = plt.subplots(1,1,figsize=figsize)
    return plot_importance(booster=booster, ax=ax)


import time
import sys
import gc
import pickle

In [27]:
items = pd.read_csv("./input/items.csv")
shops = pd.read_csv("./input/shops.csv")
cats = pd.read_csv("./input/item_categories.csv")
train = pd.read_csv("./input/sales_train.csv")

test = pd.read_csv("./input/test.csv").set_index("ID")

In [9]:
cats.item_category_id.unique()

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16,
       17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33,
       34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50,
       51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67,
       68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83])

In [10]:
train.head()

         date  date_block_num  shop_id  item_id  item_price  item_cnt_day
0  02.01.2013               0       59    22154      999.00           1.0
1  03.01.2013               0       25     2552      899.00           1.0
2  05.01.2013               0       25     2552      899.00          -1.0
3  06.01.2013               0       25     2554     1709.05           1.0
4  15.01.2013               0       25     2555     1099.00           1.0

In [15]:
test.head()

    shop_id  item_id
ID
0         5     5037
1         5     5320
2         5     5233
3         5     5232
4         5     5268

In [28]:
mat = []
cols = ['date_block_num', 'shop_id','item_id']
for i in range(34):
    sales = train[train.date_block_num==i]
    mat.append(np.array(list(product([i], sales.shop_id.unique(), sales.item_id.unique())), dtype='int16'))

In [29]:
mat = pd.DataFrame(np.vstack(mat), columns=cols)

In [30]:
train[train.date_block_num==0]

              date  date_block_num  shop_id  item_id  item_price  item_cnt_day
0       02.01.2013               0       59    22154      999.00           1.0
1       03.01.2013               0       25     2552      899.00           1.0
2       05.01.2013               0       25     2552      899.00          -1.0
3       06.01.2013               0       25     2554     1709.05           1.0
4       15.01.2013               0       25     2555     1099.00           1.0
...            ...             ...      ...      ...         ...           ...
115685  19.01.2013               0       46       32      349.00           1.0
115686  18.01.2013               0       46       32      349.00           1.0
115687  26.01.2013               0       46       35      399.00           2.0
115688  31.01.2013               0       46      621      149.00           1.0
115689  07.01.2013               0       46       32      349.00           1.0

[115690 rows x 6 columns]

In [31]:
mat

          date_block_num  shop_id  item_id
0                      0       59    22154
1                      0       59     2552
2                      0       59     2554
3                      0       59     2555
4                      0       59     2564
...                  ...      ...      ...
10913845              33       21     7635
10913846              33       21     7638
10913847              33       21     7640
10913848              33       21     7632
10913849              33       21     7440

[10913850 rows x 3 columns]

In [33]:
group = train.groupby(['date_block_num', 'shop_id', 'item_id']).agg({'item_cnt_day':['sum']})

In [22]:
product(cols, cols)

In [35]:
group.columns = ['item_cnt_month']

In [36]:
group

                                item_cnt_month
date_block_num shop_id item_id
0              0       32                  6.0
                       33                  3.0
                       35                  1.0
                       43                  1.0
                       51                  2.0
...                                        ...
33             59      22087               6.0
                       22088               2.0
                       22091               1.0
                       22100               1.0
                       22102               1.0

[1609124 rows x 1 columns]

In [37]:
group.reset_index(inplace=True)

In [38]:
group

         date_block_num  shop_id  item_id  item_cnt_month
0                     0        0       32             6.0
1                     0        0       33             3.0
2                     0        0       35             1.0
3                     0        0       43             1.0
4                     0        0       51             2.0
...                 ...      ...      ...             ...
1609119              33       59    22087             6.0
1609120              33       59    22088             2.0
1609121              33       59    22091             1.0
1609122              33       59    22100             1.0
1609123              33       59    22102             1.0

[1609124 rows x 4 columns]

In [39]:
mat = pd.merge(mat, group, on=cols, how='left')

In [40]:
mat

          date_block_num  shop_id  item_id  item_cnt_month
0                      0       59    22154             1.0
1                      0       59     2552             NaN
2                      0       59     2554             NaN
3                      0       59     2555             NaN
4                      0       59     2564             NaN
...                  ...      ...      ...             ...
10913845              33       21     7635             NaN
10913846              33       21     7638             NaN
10913847              33       21     7640             NaN
10913848              33       21     7632             NaN
10913849              33       21     7440             NaN

[10913850 rows x 4 columns]